{
  "crew": [
    {
      "day": 1,
      "itinerary": {
        "morning": "Depart from Nashik early in the morning and drive to Pune, approximately a 4-hour drive. Check into a budget-friendly hotel in Pune such as the Treebo Trend Sapphire or the Hotel Executive.",
        "afternoon": "Have lunch at a local café in Pune. Visit Shaniwar Wada, a historical fortification and palace in Pune.",
        "evening": "Explore the Aga Khan Palace, a historical palace with stunning architecture and a museum. Enjoy shopping at MG Road and have dinner at a popular local restaurant like Vaishali or Shreyas.",
        "night": "Stay at Treebo Trend Sapphire or Hotel Executive."
      },
      "detailed_budget_description": "Morning Day 1: Breakfast might be included in the hotel rate. If not, expect to spend around $10 per person. For transportation, a rental car or fuel cost could be approximately $30-$50. Accommodation per night is expected to be around $50-$80. Afternoon Day 1: A light lunch at a local café should cost around $10-$15 per person. Entrance fee for Shaniwar Wada is approximately $3 per person. Evening Day 1: Entrance fee for Aga Khan Palace is around $5 per person. Dinner at a local restaurant could range from $15-$30 per person. Shopping expenses will vary based on personal preference but budget around $20-$50. Night Day 1: Miscellaneous costs, including snacks or tips, should be about $10-$20. Total budget for Day 1: approximately $135-$240."
    },
    {
      "day": 2,
      "itinerary": {
        "morning": "Drive to Sinhagad Fort for a morning trek and enjoy the panoramic views. Have breakfast at local eateries around the fort.",
        "afternoon": "Return to Pune and have lunch at a local restaurant. Visit the Raja Dinkar Kelkar Museum to explore its vast collection of artifacts and antiques.",
        "evening": "Relax at the Osho International Meditation Resort or enjoy a walk around Koregaon Park. Have dinner at a trendy restaurant like The 5 Star or Baan Tao.",
        "night": "Stay at Treebo Trend Sapphire or Hotel Executive."
      },
      "detailed_budget_description": "Morning Day 2: Breakfast at local eateries around Sinhagad Fort should cost about $5-$10. Entrance fee to Sinhagad Fort is usually free, but budget around $5 for any additional expenses. Transportation costs for the day could be around $20-$30. Afternoon Day 2: Lunch at a local restaurant may cost about $15 per person. Entrance fee to Raja Dinkar Kelkar Museum is around $5 per person. Evening Day 2: Dinner at a mid-range restaurant could be around $25-$40 per person. Miscellaneous costs, including tips and snacks, could be around $10-$15. Total budget for Day 2: approximately $130-$205."
    },
    {
      "day": 3,
      "itinerary": {
        "morning": "Drive to Lonavala and enjoy the scenic views. Visit Bhushi Dam for a morning hike or relaxation.",
        "afternoon": "Have lunch in Lonavala at a popular spot like Golden Vada Pav or Kinara Village Dhabha. Visit the Karla Caves or Bhaja Caves if time permits.",
        "evening": "Return to Pune and explore the Pune University campus or attend a cultural event if available. Dinner at a local restaurant.",
        "night": "Stay at Treebo Trend Sapphire or Hotel Executive."
      },
      "detailed_budget_description": "Morning Day 3: Breakfast can be included in the hotel cost. If eating out, expect to spend around $10. Transportation to Lonavala could be about $30-$50. Afternoon Day 3: Lunch at a popular eatery should cost around $10-$20 per person. Entrance fees for Karla Caves are approximately $10 per person. Evening Day 3: Dinner in Pune could be around $15-$30 per person. Miscellaneous costs including tips, snacks, and small purchases could be around $10-$20. Total budget for Day 3: approximately $135-$220."
    },
    {
      "day": 4,
      "itinerary": {
        "morning": "Check out of the hotel and drive to Mahabaleshwar. Stop at scenic points like Elphinstone Point or Arthur’s Seat.",
        "afternoon": "Arrive in Mahabaleshwar and have lunch at a local restaurant. Check into a budget-friendly hotel such as Hotel Dreamland or Hotel Savoy.",
        "evening": "Explore the local markets and enjoy dinner at a recommended restaurant like Mapro Garden or The Grapevine.",
        "night": "Stay at Hotel Dreamland or Hotel Savoy."
      },
      "detailed_budget_description": "Morning Day 4: Breakfast might be included with your hotel stay, otherwise, expect to spend around $10. Transportation to Mahabaleshwar, including fuel and tolls, could be around $30-$50. Afternoon Day 4: Lunch at a local restaurant could cost about $10-$20 per person. Accommodation for the night should range from $50-$80. Evening Day 4: Dinner at a well-regarded restaurant may cost around $20-$30 per person. Miscellaneous expenses like shopping or snacks could be around $10-$15. Total budget for Day 4: approximately $130-$205."
    },
    {
      "day": 5,
      "itinerary": {
        "morning": "Visit Venna Lake for boating or a leisurely stroll. Have breakfast at a local eatery.",
        "afternoon": "Explore Mahabaleshwar’s local attractions like the Mahabaleshwar Temple or the strawberry farms. Have lunch at a nearby café.",
        "evening": "Return to Pune and relax. Dinner at a different local restaurant or try street food.",
        "night": "Stay at Treebo Trend Sapphire or Hotel Executive."
      },
      "detailed_budget_description": "Morning Day 5: Breakfast at local eateries could cost about $10. Boating at Venna Lake might cost around $10 per person. Transportation back to Pune would be about $30-$50. Afternoon Day 5: Lunch at a café could be around $10-$15 per person. Visiting local attractions might have minimal entry fees, around $5. Evening Day 5: Dinner in Pune could be approximately $15-$30 per person. Miscellaneous costs for the day might be about $10-$20. Total budget for Day 5: approximately $130-$210."
    },
    {
      "day": 6,
      "itinerary": {
        "morning": "Drive to Alibaug and visit the Alibaug Beach. Have breakfast at a local café.",
        "afternoon": "Explore the area and have lunch at a popular local restaurant. Visit the Kolaba Fort if time permits.",
        "evening": "Return to Pune and enjoy a relaxing evening. Have dinner at a different restaurant or try street food.",
        "night": "Stay at Treebo Trend Sapphire or Hotel Executive."
      },
      "detailed_budget_description": "Morning Day 6: Breakfast at a café could cost around $10. Transportation to Alibaug, including fuel and tolls, might be around $30-$50. Afternoon Day 6: Lunch at a local restaurant might be about $10-$20 per person. Entrance fee for Kolaba Fort could be around $5. Evening Day 6: Dinner in Pune could be around $15-$30 per person. Miscellaneous costs for the day might be about $10-$20. Total budget for Day 6: approximately $130-$205."
    },
    {
      "day": 7,
      "itinerary": {
        "morning": "Check out of the hotel and visit the Osho International Meditation Resort for a morning of relaxation or exploration.",
        "afternoon": "Have lunch at a local restaurant in Pune and do some last-minute shopping or sightseeing.",
        "evening": "Prepare for departure. Have a farewell dinner at a nice restaurant or café.",
        "night": "End the trip and head back home or to the airport."
      },
      "detailed_budget_description": "Morning Day 7: Breakfast might be included with the hotel stay. If not, expect to spend around $10. Entrance fee for Osho International Meditation Resort might be around $10-$20 per person. Afternoon Day 7: Lunch at a local restaurant could be about $15. Shopping or additional activities may vary but budget around $20. Evening Day 7: Dinner at a good restaurant could be around $25-$40 per person. Miscellaneous costs for the day might be around $10-$15. Total budget for Day 7: approximately $130-$200."
    }
  ]
}
